app/controllers/api/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    if params[:search_string]
      @projects = Project.search_by_title(params[:search_string])
    else
      @projects = Project.all