app/controllers/api/steps_controller.rb

SELECT  "steps".* FROM "steps" WHERE "steps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    step = Step.find(params[:id])