app/views/api/projects/show.json.jbuilder


@project.steps.each do |step|
---
SELECT "steps"."id" FROM "steps" WHERE "steps"."project_id" = $1  [["project_id", 1]]