app/controllers/steps_controller.rb

   def show
    @step = Step.find(params[:id])
---
SELECT  "steps".* FROM "steps" WHERE "steps"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]