app/models/user.rb

  def self.find_by_credentials(username, password)
    @user = User.find_by({username: username})
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "joneye1"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = generate_token
    self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "wdzZfBOAmoosx7ZKDOiAKg"], ["updated_at", "2019-02-27 00:02:52.792231"], ["id", 3]]